---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetallicpaintFlecksType
source: html/f5e40488-00ee-c477-e6f7-6d7d85b9c2f7.htm
---
# Autodesk.Revit.DB.Visual.MetallicpaintFlecksType

The enumerated type representing the permitted values for the asset property "MetallicpaintFlecks" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public enum MetallicpaintFlecksType
```